WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
static int meadow_measure_freq_cfg_timer(mdwFreqTimerInfo_t *mdwFreqTimerInfo,
                bool configure);
static int meadow_measure_freq_isr(int irq, void *context, void *arg);

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/
// This ISR is called for all frequency with duty cycle interrupts.
//
// On the first leading edge of the input, the timer clears the CNT count and
// CNT begins counting up.
// On the following trailing edge, the timer copies the CNT value into CCR2.
// On the next leading edge, the timer copies the CNT value into CCR1 and CNT
// is again cleared to zero and the process repeats.
// This means that we must save the CCR1 and CCR2 timer values between the
// leading edge and the trailing edge.
// For 16-bit timers, this is more complex because we must maintain a count
// for each CNT overflow interrupt. This allows us to maintain a 32-bit value.
// For CCR1 overflow for the entire period but for CCR2 only between the
// leading edge and the trailing edge.

// Note: a 16-bit register at 96 MHz will overflow every 683 microseconds.
int meadow_measure_freq_isr(int irq, void *context, void *arg)
{
  mdwFreqTimerInfo_t *mdwFreqTimerInfo = (mdwFreqTimerInfo_t *)arg;
  mdwFreqRtData_t *mdwFreqRtData = mdwFreqTimerInfo->mdwFreqRtData;

  uint32_t timerBase = mdwFreqTimerInfo->timerBase;
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  if(mdwFreqRtData == NULL)
  {
    syslog(1, "%s@%d-mdwFreqRtData is NULL in ISR\n", __FILE__, __LINE__);
    return ERROR;  // -1
  }

  // (--) Diag
  stm32_gpiowrite(DEBUG_PIN_V2_D06, true);

  // The Problem with 16-bit timers.
  // At certain input frequencies the CNT being cleared and the CNT overflow
  // are reported in the same interrupt. However, there is only 1 bit available
  // to indicate both conditions.
  // The highest frequency this occurs at is TimerClock/65536, which is
  // 1,464.844 Hz with a timer clock of 96 MHz. This reoccurs at the intervals
  // (TimerClock/65536)/2, (TimerClock/65536)/3 etc.
  // More details.
  // For most input frequencies, on a leading (e.g. rising) or trailing (e.g.
  // falling) edge an interrupt is generated containing the CC1IF (leading) or
  // CC2IF (trailing) flags set. The UIF flag is always set with the CC1IF
  // flag, to indicate that the CNT register has been cleared. However, at
  // some frequencies, the overflow and the CNT reset occur at the same moment.
  // The UIF is set but it cannot be determined if it indicates CNT overflow or
  // CNT reset.
  switch(timStatusReg & 0x0007)
  {
    case 0x00:    // Nothing happened, just ignore
      break;

    //------------------------------------------------------------
    case 0x01:    // Lone UIF flag. CNT register changed, either reset or overflow)
      timStatusReg &= ~GTIM_SR_UIF;

      // Add to Leading to leading overflow
      mdwFreqRtData->leadToLeadOverflow++;
      break;

    //------------------------------------------------------------
    // Leading Edge
    case 0x02:    // Lone leading edge, never expected
      timStatusReg &= ~GTIM_SR_CC1IF;
      mdwFreqRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    case 0x03:     // Leading edge + UIF (Normal for End/Start of capture)
      timStatusReg &= ~GTIM_SR_UIF;   // Could be overflow or CNT reset
      timStatusReg &= ~GTIM_SR_CC1IF; // Leading edge should be CNT reset

      if(mdwFreqTimerInfo->timerWidth == MEADOW_FREQ_DC_TIMER_WIDTH_32)
      {
        // At this point we've seen a trailing edge and no errors.
        // Verify that we are expecting this leading edge
        if(mdwFreqRtData->activeState == MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING)
        {
          // A complete cycle has been seen. Save new values for user access
          mdwFreqRtData->countLeadToLead  = getreg32(timerBase + STM32_GTIM_CCR1_OFFSET);
          mdwFreqRtData->countLeadToTrail = getreg32(timerBase + STM32_GTIM_CCR2_OFFSET);

          // Add current to total timer count for frequency average and
          // increment the GPIO input count.
          mdwFreqRtData->countTimerTotal += mdwFreqRtData->countLeadToLead;
          mdwFreqRtData->countInputTotal++;
        }
        else
        {
          mdwFreqRtData->countLeadToLead = 0;
          mdwFreqRtData->countLeadToTrail = 0;
        }

        mdwFreqRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING;
        break;
      }

      // Must be 16-bit timer
      uint32_t count1;
      uint32_t count2;

      if(mdwFreqRtData->activeState == MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING)
      {
        // Read current 16-bit values
        count1 = getreg16(timerBase + STM32_GTIM_CCR1_OFFSET);
        count2 = getreg16(timerBase + STM32_GTIM_CCR2_OFFSET);

        // Add each 16-bit CNT overflow to counts
        count1 += (mdwFreqRtData->leadToLeadOverflow * MEADOW_FREQ_DC_16_BIT_OVERFLOW_COUNT);
        count2 += (mdwFreqRtData->leadToTrailOverflow * MEADOW_FREQ_DC_16_BIT_OVERFLOW_COUNT);

        // Check for various detectable errors. There are some that cannot
        // be detected.

        // Since there's a limit to the highest frequency we can detect, we
        // need to check if we've gone beyond a reasonable frequency.
        if(count1 < MEADOW_FREQ_DC_MINIMUM_USABLE_CNT)
        {
          count1 = 0;
          count2 = 0;
        }
        else if(count1 < count2)
        {
          // This works in many cases, one is the initial frequency
          // that causes trouble (i.e. TimerClock/65536). However, it may be
          // that multiple overflow interrupts have been missed.
          count1 += MEADOW_FREQ_DC_16_BIT_OVERFLOW_COUNT;
        }
        else
        {
          // Reasonable Duty Cycle test, must be > 1.0% and < 99.0%
          uint32_t dutyCycle = (count2 * 1000)/count1;
          if(dutyCycle < 10 || dutyCycle > 990)
          {
            count1 = 0;
            count2 = 0;
          }
        }
      }
      else
      {
        count1 = 0;
        count2 = 0;
      }

