WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
      // Provide consumer with values
      mdwFreqRtData->countLeadToLead = count1;
      mdwFreqRtData->countLeadToTrail = count2;

      // Add current to total timer count for frequency average
      // and maintain the input count.
      mdwFreqRtData->countTimerTotal += count1;
      mdwFreqRtData->countInputTotal++;
      
      // Clear previous overflow
      mdwFreqRtData->leadToLeadOverflow = 0;
      mdwFreqRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING;
      break;

    // Trailing Edge
    case 0x05:    // Trailing edge with UIF (i.e. Trailing Edge + Overflow)
      timStatusReg &= ~GTIM_SR_UIF;

    case 0x04:    // Trailing edge alone. End of CCR2 capture.
      timStatusReg &= ~GTIM_SR_CC2IF;

      // Trailing edge check if there has been a valid leading edge
      if(mdwFreqRtData->activeState != MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING)
      {
        mdwFreqRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
        break;  // And quit
      }
      
      // Trailing edge means we're done with CCR2's value. We don't need
      // to worry about CNT overflow with respect to CCR2 either.
      if(timStatusReg & GTIM_SR_UIF)
        mdwFreqRtData->leadToLeadOverflow++;    // Adjust overflow count

      // Time to capture the first half overflow
      mdwFreqRtData->leadToTrailOverflow = mdwFreqRtData->leadToLeadOverflow;

      // This value will be tested when the leading edge arrives
      mdwFreqRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING;
      break;

    //------------------------------------------------------------
    case 0x06:    // (illegal) Rising and Falling together, no way
      timStatusReg &= ~GTIM_SR_CC1IF;
      timStatusReg &= ~GTIM_SR_CC2IF;
      mdwFreqRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    case 0x07:    // (illegal) Rising and Falling plus UIF
      // This case exists when the duty cycle is very small (< 0.5%) or very
      // large (> 99.5%)
      timStatusReg &= ~GTIM_SR_CC1IF;
      timStatusReg &= ~GTIM_SR_CC2IF;
      timStatusReg &= ~GTIM_SR_UIF;
      mdwFreqRtData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    // There are only 3 bits to check, so this is a not needed. We've checked
    // all possible combinations
    default:
      break;
  }

  // Clear status register
  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);

  // (--) Diag
  stm32_gpiowrite(DEBUG_PIN_V2_D06, false);
  return OK;
}

//=============================================================
static uint32_t meadow_measure_freq_get_apb_clock(
          mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerAPBClk)
    return STM32_RCC_APB2ENR;
  else
    return STM32_RCC_APB1ENR;
}

//=============================================================
// Uses the bit-field to determine the Timer clock
static uint32_t meadow_measure_freq_get_max_clock(
          const mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerMaxClk)
    return STM32_APB2_TIM1_CLKIN;
  else
    return STM32_APB1_TIM2_CLKIN;
}

//=============================================================
static void meadow_measure_freq_disable(const uint32_t timerBase)
{
  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
static void meadow_measure_freq_enable(const uint32_t timerBase)
{
  // Enable timer Counter
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  // Re-initialize the counter and generates an update of the registers
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=====================================================================
// The following finds the specified timer's built-in timer information.
mdwFreqTimerInfo_t *meadow_measure_freq_get_timer_info(const int timerNumb)
{
  mdwFreqTimerInfo_t *timerInfo = &(freqTimerInfoArray[timerNumb - 1]);

  if(timerInfo->timerOkay)
    return timerInfo;

  return NULL;
}

//=============================================================
// This function will evaluate the GPIO based on 3 tables that contain the
// legal GPIOs for the CCM (all F7 GPIOs checked) and for F7v1 and F7v2.
// It returns the channel, 1-4 unless not found, then returns 0.
static uint8_t meadow_measure_freq_from_pin_port_get_chan(const int timerNumb,
          uint8_t portAndPin)
{
  int entry;
  int timerOffset = timerNumb - 1;

  if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V1)
  {
    // Verify pin & port are valid
    entry = 0;
    while(validGpioF7v1Array[timerOffset][entry] != 0xff)
    {
      if(portAndPin == validGpioF7v1Array[timerOffset][entry])
      {
        syslog(1, "%s@%d- V1 so far good\n", __FILE__, __LINE__);
      }
      entry++;
    }
    if(validGpioF7v1Array[timerOffset][entry] == 0xff)
     return 0;
  }
  else if (meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V2)
  {
    // Verify pin & port are valid
    entry = 0;
    while(validGpioF7v2Array[timerOffset][entry] != 0xff)
    {
      if(portAndPin == validGpioF7v2Array[timerOffset][entry])
      {
        break;    // So far good
      }
      entry++;
    }
    
    if(validGpioF7v2Array[timerOffset][entry] == 0xff)
      return 0;
  }
  else if (meadow_hw_version_get() != MEADOW_F7_HW_VERSION_NUMB_CCMV2)
  {
    // Unsupported device type
    syslog(1, "%s@%d- Unknown device type\n", __FILE__, __LINE__);
    return 0;
  }

  // All types are verified here too and pickup channel from this table
  entry = 0;
  while(validStm32F7GpioArray[timerOffset][entry].portPin != 0xff)
  {
    if(portAndPin == validStm32F7GpioArray[timerOffset][entry].portPin)
    {
      return validStm32F7GpioArray[timerOffset][entry].chan;
    }
    entry++;
  }

