WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called by Meadow.Core to configure
// Timer numbers range from 1 - 14. However, some are not defined.
int meadow_measure_freq_freq_duty_config(const int timerNumber,
          const uint8_t portAndPin, const uint8_t gpioPolarity)
{
  int ret;
  uint32_t inputGpioConfig;
  static bool firstTime = true;

  if(firstTime)
  {
    firstTime = false;

    // (--) Diag config LED
    stm32_configgpio(DEBUG_PIN_V2_D06);
    // (--) Diag LED
  }

  // Insure a correct timer / pin+port combination was supplied.
  // Timers have, at most, 1-4 channels, each representing 1 GPIO. For the
  // specified timer we need to verify a proper port and pin.
  uint8_t timerChan = meadow_measure_freq_from_pin_port_get_chan(timerNumber,
            portAndPin);
  if(timerChan == 0)
  {
    syslog(2, "%s@%d-The GPIO/Timer combination not valid\n",
              __FILE__, __LINE__);
    return -ENOTSUP;
  }

  // Check if there's already an object in this slot.
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_get_timer_info(timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Timer %ld not defined\n",
              __FILE__, __LINE__, timerNumber);
    return -ERROR;
  }

  if(mdwFreqTimerInfo->mdwFreqRtData != NULL)
  {
    syslog(LOG_ERR, "%s@%d-Already timer defined in slot.\n", __FILE__, __LINE__);
    return -ERROR;
  }

  // Enough to build the input configuration for the a GPIO
  inputGpioConfig = MEADOW_TIMER_GPIO_CONST | portAndPin | \
            mdwFreqTimerInfo->timerAltFunc;

  // Diagnostic
  // syslog(1, "%s@%d-input Pin defn:0x%02x (P%c%d), Pin defn + AF:0x%08lx\n",
  //           __FILE__, __LINE__, portAndPin,
  //           ((portAndPin) >> 4) + 'A', portAndPin & 0x0f, inputGpioConfig);
  // Diagnostic

  // Valid GPIO so configure input point for timer.
  ret = stm32_configgpio(inputGpioConfig);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:stm32_configgpio() returned:%ld\n",
              __FILE__, __LINE__, ret);
    return -ENOTSUP;   // Not supported
  }

  // Allocate a new struct for each new timer to contain runtime data.
  mdwFreqTimerInfo->mdwFreqRtData = zalloc(sizeof(mdwFreqRtData_t));
  if(mdwFreqTimerInfo->mdwFreqRtData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Allocation for mdwFreqRtData_s NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }

  // Initialized the timer hardware
  ret = meadow_measure_freq_cfg_timer(mdwFreqTimerInfo, true);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow frequency+dc init failed:%d\n", __FILE__, __LINE__, ret);
    free(mdwFreqTimerInfo->mdwFreqRtData);
    return ret;
  }

  // With a place to put the information, we can start filling the structure.
  mdwFreqTimerInfo->mdwFreqRtData->activeState     = MEADOW_FREQ_DC_FREQ_DC_SYNC_UNKNOWN;
  mdwFreqTimerInfo->mdwFreqRtData->inputPolarity   = gpioPolarity;
  mdwFreqTimerInfo->mdwFreqRtData->inputConfig     = inputGpioConfig;
  mdwFreqTimerInfo->mdwFreqRtData->inputTimerChan  = timerChan;
  mdwFreqTimerInfo->mdwFreqRtData->countInputTotal = 0;
  mdwFreqTimerInfo->mdwFreqRtData->countTimerTotal = 0;

  return OK;
}

//=============================================================
// Frequency and duty cycle configuration of timer registers.
// It will configure and unconfigure 
int meadow_measure_freq_cfg_timer(mdwFreqTimerInfo_t *mdwFreqTimerInfo,
          bool configure)
{
  // See RM0410 Reference manual for STM32F76xxx and STM32F77xxx section 26.3.6
  // for original concept.

  // A single input (T1) is used. It is configured as input to Compare/Capture
  // registers 1 and 2. For CCR1 it is configured to for leading edge interrupt
  // and trailing edge for CCR2. By using the count between interrupts for one
  // CCR's (i.e. leading to leading edges) the frequency can be found by
  // counting between interrupts from leading to trailing the duty cycle can be
  // found.

  int ret;
  uint16_t regVal16;
  uint32_t regVal32;
  uint32_t timerBase;

  timerBase = mdwFreqTimerInfo->timerBase;

  //(++) Only disables channels 1 & 2. Disabling all 4 is probably okay as
  // as at the end of configuration all needed channels are correct.
  // Before starting disable capture/control for input 1 and 2 by setting CC1E
  // and CC2E to 0. Ref Man (26.4.7 at end) "Note: CC1S bits are writable only
  // when the channel is OFF (CC1E = 0 in TIMx_CCER)."
  //(++) Need to modify different bits (not 0xffcc) for channel 3 & 4
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  regVal16 &= 0xffcc;   // c = 1110, clear CC1E and CC2E bits 0 & 4
  putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);

  //(++) The following only configure inputs 1 & 2
  // 1. Select the active input for TIMx_CCR1: write the CC1S bits to 01 in
  // the TIMx_CCMR1 register (TI1 selected).
  // Ref Man "01: CC1 channel is configured as input, IC1 is mapped on TI1."
  regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
  regVal32 &= 0xfffffffc;   // c = 1100, clear CC1S bits 1:0
  regVal32 |= 0x00000001;   // 1 = 0001, set '01'
  putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

  //(++) only bits for input 1 are considered
  // 2. Select the active polarity for TI1FP1 (used both for capture in
  // TIMx_CCR1 and counter clear): write the CC1P to ‘0’ and the CC1NP bit to
  // ‘0’ (active on rising edge).
  // Note: the CCR1 register is readonly so the above configuration
  // instructions are wrong.
  // Capture/Compare Enable Register (CCER) is were the polarity is set by
  // CC1P & CC1NP. In Ref Man the CC1P for input describes both the CC1P and
  // CC1NP bit as if a 2 bit field. But they are actually bit 1 and bit 3.
  // Ref Man "00: non-inverted/rising edge, 01: inverted/falling edge
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  regVal16 &= 0xfff5;   // 5 = 0101, clear GTIM_CCER_CC1NP (bit 3) & GTIM_CCER_CC1P (bit 1)

