WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  if(mdwFreqTimerInfo->mdwFreqRtData->inputPolarity) // 0 = leading is rising, 1 = leading is falling
    regVal16 |= 0x0002;         // Set bit 1 to change 00 to 01 (inverted/falling)

  putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);
  
  //(++) Only addresses channels 1 & 2
  // 3. Select the active input for TIMx_CCR2: write the CC2S bits to 10 in the TIMx_CCMR1
  // register (TI1 selected).
  // Ref Man "10: CC2 channel is configured as input, IC2 is mapped on TI1"
  regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
  regVal32 &= 0xfffffcff;   // c = 1100, clear CC2S bits 9:8
  regVal32 |= 0x00000200;   // 2 = 0010, set to '10'
  putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

  // (--) Already modified but only considers channels. There are other bits for 3 & 4
  // 4. Select the active polarity for TI1FP2 (used for capture in TIMx_CCR2): write the CC2P
  // bit to ‘1’ and the CC2NP bit to ’0’ (active on falling edge).
  // Ref Man "01: inverted/falling edge
  //  Circuit is sensitive to TIxFP1 falling edge (capture, trigger in reset,
  //  external clock or trigger mode), TIxFP1 is inverted (trigger in gated
  //  mode, encoder mode)."
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  regVal16 &= 0xff5f;   // 5 = 0101, clear GTIM_CCER_CC2NP (bit 7) &
  //                                       GTIM_CCER_CC2P (bit 5).

  // CC2P & CC2NP must be opposite of CC1P & CC1NP
  // (--) SOMETHING SEEMS WRONG. ARE WE JUST CHECKING FOR '0'?

  // 0 = leading is rising, 1 = leading is falling
  if(!mdwFreqTimerInfo->mdwFreqRtData->inputPolarity)
    regVal16 |= 0x0020;           // 2 = 0010 set bit 5 and leave bit 7 clear

  putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);

  // (--) Only handles some channels not all
  // 5. Select the valid trigger input: write the TS bits to 101 in the TIMx_SMCR
  // register (TI1FP1 selected). Ref Man "101: Filtered Timer Input 1 (TI1FP1)"
  regVal32 = getreg32(timerBase + STM32_GTIM_SMCR_OFFSET);
  regVal32 &= 0xffffff8f;   // 8 = 1000, clear TS bits 6:4
  regVal32 |= 0x00000050;   // 5 = 0101 sets '101'
  putreg32(regVal32, timerBase + STM32_GTIM_SMCR_OFFSET);   // ?? NEEDED??

  // (--) THIS REGISTER IS GENERIC, NOTHING RELATED TO CHANNELS
  // 6. Configure the slave mode controller in reset mode: write the SMS bits
  // to 100 in the TIMx_SMCR register. Reg Man "0100: Reset Mode - Rising edge
  // of the selected trigger input (TRGI) reinitializes the counter and
  // generates an update of the registers."
  regVal32 = getreg32(timerBase + STM32_GTIM_SMCR_OFFSET);   // ?? NEEDED??
  regVal32 &= 0xfffefff8;    // e = 1110, Clear SMS bit 16, 8 = 1000, clear 2:0
  regVal32 |= 0x00000004;    // 4 = 0100 sets 2:0 = '100', leave bit 16 = 0
  putreg32(regVal32, timerBase + STM32_GTIM_SMCR_OFFSET);

  // (--) Only some channels are handled
  // (--) SOMETHING SEEMS WRONG. IS IT CC1E AND CC2E OR CC1E AND CC1P?
  // CODE IS CCIP COMMENTS ARE CC2E.
  // 7. Enable the captures: write the CC1E (bit 0) and CC2E (bit 4) bits to
  // ‘1' in the TIMx_CCER register.
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  regVal16 |= 0x0011;   // set bit 0 and bit 4
  putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);
  
  // To enable the timer we needed to know which clock enable register to use.
  uint32_t apbClock = meadow_measure_freq_get_apb_clock(mdwFreqTimerInfo);

  // And we need to know which bit to set in the register, which is in the
  // array. 
  modifyreg32(apbClock, 0, mdwFreqTimerInfo->timerClkEn);

  // (--) Timer wide setting
  // Must be between 0 and 0xffff. Set the prescaler value of 0 to allow
  // highest speed. A prescaler value of 1 will divide the clock by 2.
  // (--) NEW FEATURE IMPLEMENTED HERE ALLOW USER TO SELECT FREQUENCY VIA
  // SLOW, MEDIUM AND FAST SELECTION? BUT NOT PER CHANNEL.
  // Find proper pre-scaler value so all timers run at the same speed, no
  // matter which clock line they are connected to.
  uint16_t prescaler = (meadow_measure_freq_get_max_clock(mdwFreqTimerInfo)/ \
            MEADOW_FREQ_DC_CLOCK_FREQ) - 1;
  putreg16(prescaler, timerBase + STM32_GTIM_PSC_OFFSET);

  // The value put into the ARR is maximum allowed for the timer. Either
  // 32-bit or 16-bit ARR register.
  uint32_t maxARRValue = mdwFreqTimerInfo->timerWidth ==
            MEADOW_FREQ_DC_TIMER_WIDTH_16 ? 0xffff : 0xffffffff;
  putreg32(maxARRValue, timerBase + STM32_GTIM_ARR_OFFSET);

  // (--) Timer wide setting
  uint16_t regval = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  regval |= GTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
  putreg16(regval, timerBase + STM32_GTIM_CR1_OFFSET);

  // (--) Timer wide setting
  // Clear all interrupt sources and set the ones we need. CC1IE is the rising
  // edge, CC2IE is the falling edge and UIE is whenever the CNT register is
  // cleared or overflows, DMA/Interrupt enable register (DIER)
  // Advanced timers 1 & 8 add ATIM_DIER_COMIE | ATIM_DIER_BIE | ATIM_DIER_COMDE
  modifyreg16(timerBase + STM32_GTIM_DIER_OFFSET, 
        GTIM_DIER_TDE   | GTIM_DIER_CC4DE | GTIM_DIER_CC3DE | GTIM_DIER_CC2DE |
        GTIM_DIER_CC1DE | GTIM_DIER_UDE   | GTIM_DIER_TIE   | GTIM_DIER_CC4IE |
        GTIM_DIER_CC3IE | GTIM_DIER_CC2IE | GTIM_DIER_CC1IE | GTIM_DIER_UIE,
        GTIM_DIER_CC1IE | GTIM_DIER_CC2IE | GTIM_DIER_UIE);  

  // All Frequency/Duty Cycle interrupts are handled by same isr
  ret = irq_attach(mdwFreqTimerInfo->timerIrqVec,
            meadow_measure_freq_isr,  // ISR address
            mdwFreqTimerInfo);         // Argument to ISR
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-irq_attach failed, ret:%d, errno:%d\n",
          __FILE__, __LINE__, ret, errno);
    return ret;
  }

  // Get things ready
  mdwFreqTimerInfo->mdwFreqRtData->activeState =
            MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;

  // Enable IRQ
  up_enable_irq(mdwFreqTimerInfo->timerIrqVec);

  // Enable timer
  meadow_measure_freq_enable(timerBase);
  return OK;
}

//=============================================================
// Called to unconfigure a timer
int meadow_measure_freq_freq_duty_unconfig(const uint32_t timerNumber)
{
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_get_timer_info(timerNumber);

  // Is this slot being used?
  if(mdwFreqTimerInfo->mdwFreqRtData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Can't unconfigure, this timer %lu not configured.\n",
              __FILE__, __LINE__, timerNumber);
    return -EBADSLT;    // Invalid slot
  }

  // Stop interrupts
  up_disable_irq(mdwFreqTimerInfo->timerIrqVec);

  // Stop timer
  meadow_measure_freq_disable(mdwFreqTimerInfo->timerBase);

  // Unconfigure GPIO
  stm32_unconfiggpio(mdwFreqTimerInfo->mdwFreqRtData->inputConfig);

  // Free runtime memory
  free(mdwFreqTimerInfo->mdwFreqRtData);
  mdwFreqTimerInfo->mdwFreqRtData = NULL;
  return OK;
}

//================================================================
// Return Frequency and Duty Cycle information to caller.
int meadow_measure_freq_return_freq_info(mdwFreqReturnData_t
          *returnData)
{
  double frequency;
  double averageFreq;
  double dutyCycle;
  double totalTimerCount;
  double inputTotalCount;
  uint32_t retryCount;
  uint32_t fullCycle;
  uint32_t halfCycle;

  // Just feed pulse train into appropriate GPIO
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_get_timer_info(returnData->timerNumber);
  mdwFreqRtData_t *mdwFreqRtData =
            (mdwFreqRtData_t *)mdwFreqTimerInfo->mdwFreqRtData;

  // Find valid data. That is, both full cycle and the half cycle values are
  // available. This is only an issue at higher frequencies.
  for(retryCount = 0; retryCount < 5; retryCount++)
  {
    // Get all the values at one time so once a valid value is found, a change
    // in the timer's data won't affect the output.
    // This would be nice if it was atomic
    fullCycle = mdwFreqRtData->countLeadToLead;
    halfCycle = mdwFreqRtData->countLeadToTrail;
    totalTimerCount = (double)mdwFreqRtData->countTimerTotal;
    inputTotalCount = (double)mdwFreqRtData->countInputTotal;

