WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
    if(fullCycle > 0 && halfCycle > 0)
      break;

    usleep(1 * 1000);   // delay for valid data
  }

  if(fullCycle > 0 && halfCycle > 0)
  {
    // Do floating point math and convert to integer times 1000.
    // Duty Cycle is the ratio of the full cycle count and the cycle count
    // before the trailing edge was detected.
    dutyCycle = (((double)halfCycle) * 100.0) / ((double)fullCycle);

    // The frequency is the timer's clock divided by the cycle count.
    frequency = ((double)MEADOW_FREQ_DC_CLOCK_FREQ) / ((double)fullCycle);

    // Average frequency since last read
    double averageCount = totalTimerCount / inputTotalCount;
    averageFreq = ((double)MEADOW_FREQ_DC_CLOCK_FREQ) / averageCount;

    syslog(2, "In Code-Freq:%06.2fHz, DC:%02.2f%%, AvgFreq:%06.2f, Count:%lu, retries:%lu\n",
              frequency, dutyCycle, averageFreq, inputTotalCount,
              retryCount);

    returnData->frequencyX1000  = (frequency * 1000.0);
    returnData->avgFreqX1000    = (averageFreq * 1000.0);
    returnData->dutyCycleX1000  = (dutyCycle * 1000.0);
    returnData->countInputTotal = (uint32_t)inputTotalCount;
  }
  else
  {
    syslog(2, "Invalid data CCR1:%06lu, CCR2:%06lu, retries:%lu\n",
              fullCycle, halfCycle, retryCount);
  }

  // Prevent counts from being reused
  mdwFreqRtData->countLeadToLead   = 0;
  mdwFreqRtData->countLeadToTrail  = 0;
  mdwFreqRtData->countInputTotal   = 0;
  mdwFreqRtData->countTimerTotal   = 0;

  return OK;
}
#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
